## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.neo4j will be created
  + resource "aws_ecs_service" "neo4j" {
      + cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/neo4j"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "neo4j"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "neo4j"
          + container_port   = 7474
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "neo4j"
          + container_port   = 7687
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/bolt/a9fd69aedfe7999c"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0146ac8de4816d72c",
            ]
          + subnets          = [
              + "subnet-009019231e9e7b90c",
            ]
        }

      + service_registries {
          + registry_arn = "arn:aws:servicediscovery:ca-central-1:794722365809:service/srv-p2pocy5xnbmjwc6u"
        }
    }

  # aws_lb.cartography is tainted, so must be replaced
-/+ resource "aws_lb" "cartography" {
      ~ arn                              = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:loadbalancer/net/cartography/ced7da480ec1997f" -> (known after apply)
      ~ arn_suffix                       = "net/cartography/ced7da480ec1997f" -> (known after apply)
      ~ dns_name                         = "cartography-ced7da480ec1997f.elb.ca-central-1.amazonaws.com" -> (known after apply)
      ~ enable_deletion_protection       = false -> true
      ~ id                               = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:loadbalancer/net/cartography/ced7da480ec1997f" -> (known after apply)
      ~ internal                         = false -> true
      ~ ip_address_type                  = "ipv4" -> (known after apply)
        name                             = "cartography"
      ~ security_groups                  = [] -> (known after apply)
        tags                             = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ vpc_id                           = "vpc-00a43e63b345ba0ce" -> (known after apply)
      ~ zone_id                          = "Z2EPGBW3API2WT" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "cbs-satellite-794722365809"
          ~ enabled = false -> true
          + prefix  = "lb_logs"
        }

      - subnet_mapping {
          - subnet_id = "subnet-089698b5a58022c12" -> null
        }
      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.bolt will be created
  + resource "aws_lb_listener" "bolt" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 7687
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/bolt/a9fd69aedfe7999c"
          + type             = "forward"
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 7474
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.neo4j will be created
  + resource "aws_lb_target_group" "neo4j" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "ecs"
      + port                               = 7474
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-00a43e63b345ba0ce"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
